000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КачествоОбслуживанияПродажТребование/КачествоОбслуживанияПродажТребование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КачествоОбслуживанияПродажТребование</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КачествоОбслуживанияПродажТребование/ManagerModule.bsl
//	LNK 07.06.2018 09:19:06
Процедура РегламентнаяОчистка()	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.ДокументПродажи КАК ДокументПродажи,
	|	ТаблицаРегистра.КассаККМ КАК КассаККМ
	|ИЗ
	|	РегистрСведений.КачествоОбслуживанияПродажТребование КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)"
	);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());

	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.КачествоОбслуживанияПродажТребование.СоздатьНаборЗаписей();

	Пока Выборка.Следующий() Цикл

		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.ДокументПродажи.Установить(Выборка.ДокументПродажи);
		НаборЗаписей.Отбор.КассаККМ.Установить(Выборка.КассаККМ);

		НаборЗаписей.Записать();

	КонецЦикла;

КонецПроцедуры
